title: Detect dumping SAM with sysmon
id: 123456-qwer-asdf-zxc-123456asg
status: stable
description: Detecting Windows Firewall shutdown using the netsh utility
references:
author: 'Chugunov Kirill'
date: 2024/02/12
tags:
    - T1562
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
	FileName: netsh.exe
	command|contains: state off
	command|contains: state off
    condition: selection
falsepositives:
    - Legitimate administrative action
level: critical
