title: Detect dumping SAM with sysmon
id: 123456-qwer-asdf-zxc-123456asd
status: stable
description: Dump registry branches to obtain NT hashes of local user passwords, which is based on reading from the SAM database. Most of the methods are implemented by reading the SAM, SYSTEM and SECURITY keys from the HKLM registry branch.
references:
author: 'Chugunov Kirill'
date: 2024/02/12
tags:
    - T1003
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
	command|contains: save|export hklm\SAM
    condition: selection
falsepositives:
    - Legitimate administrative action
level: critical
