title: Detect dumping SAM
id: 123456-qwer-asdf-zxc-123456ask
status: stable
description: Dump registry branches to obtain NT hashes of local user passwords, which is based on reading from the SAM database. Most of the methods are implemented by reading the SAM, SYSTEM and SECURITY keys from the HKLM registry branch.
references:
author: 'Chugunov Kirill'
date: 2024/02/13
modified: 2024/03/30
tags:
    - attack.t1210
    - attack.lateral_movement
logsource:
    service: system
    product: windows
detection:
    selection:
        EventID: 4656
        ProcessName|contains: svchost.exe
        ObjectName|contains: \REGISTRY\MACHINE\SAM
    condition: selection
level: critical
