title: Bruteforce service Windows
id: 123456-qwer-asdf-zxc-123456ash
status: stable
description: Numerous failed authentication attempts
references:
author: 'Chugunov Kirill'
date: 2024/02/13
modified: 2024/03/30
tags:
logsource:
    service: system
    product: windows
detection:
    selection:
        EventID: 4625
        Count: >1000
        Time: <10m
    condition: selection
level: critical
